In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
# Dataframe is basically multiple series that share the same index

In [4]:
# creating some dataframe with random normal data

data = np.random.randn(5, 4)
cols = ['A', 'B', 'C', 'D']

# creating dataframe (df) by seperatly passing data and column names
# we can also create dataframe using python dictionary
df = pd.DataFrame(data = data, columns=cols)

In [5]:
# cols A, B, C, D are Series object that share the same index
df

          A         B         C         D
0 -0.023375  0.343985 -0.346258 -0.069926
1  0.246381  2.990500 -0.373869 -0.157011
2 -0.584769  0.463351 -2.462991  1.291161
3 -2.465684 -0.213666  0.407437 -1.962020
4 -0.340432  0.012877 -0.235633 -0.833351

In [6]:
# Manually assigning index

index = 'U V W X Y'.split()

df.index = index

In [7]:
df

          A         B         C         D
U -0.023375  0.343985 -0.346258 -0.069926
V  0.246381  2.990500 -0.373869 -0.157011
W -0.584769  0.463351 -2.462991  1.291161
X -2.465684 -0.213666  0.407437 -1.962020
Y -0.340432  0.012877 -0.235633 -0.833351

In [8]:
# Now accessing a particular column
# it is just like python dictionary
df['A']

U   -0.023375
V    0.246381
W   -0.584769
X   -2.465684
Y   -0.340432
Name: A, dtype: float64

In [9]:
# Now accessing multiple columns

df[ ['A', 'B', 'D'] ]

          A         B         D
U -0.023375  0.343985 -0.069926
V  0.246381  2.990500 -0.157011
W -0.584769  0.463351  1.291161
X -2.465684 -0.213666 -1.962020
Y -0.340432  0.012877 -0.833351

In [10]:
# Creating new column 

# it will create new column called E and will do elementwise sum of cols A and B 
df['E'] = df['A'] + df['B']

In [11]:
df

          A         B         C         D         E
U -0.023375  0.343985 -0.346258 -0.069926  0.320610
V  0.246381  2.990500 -0.373869 -0.157011  3.236881
W -0.584769  0.463351 -2.462991  1.291161 -0.121418
X -2.465684 -0.213666  0.407437 -1.962020 -2.679350
Y -0.340432  0.012877 -0.235633 -0.833351 -0.327554

In [12]:
# Now deleting a column

# by default it is set to delete rows ( i.e axis = 0 ), if you want to delete column set (axis = 1)
# also this will return new dataframe with E column removed, inorder to do it in same dataframe set inplace=True
df.drop('E', axis = 1, inplace = True)

In [16]:
df

          A         B         C         D
U -0.023375  0.343985 -0.346258 -0.069926
V  0.246381  2.990500 -0.373869 -0.157011
W -0.584769  0.463351 -2.462991  1.291161
Y -0.340432  0.012877 -0.235633 -0.833351

In [14]:
# For deleting particular row 
# say Xth row

# by default it is set to axis = 0
df.drop('X', inplace = True)

In [15]:
df

          A         B         C         D
U -0.023375  0.343985 -0.346258 -0.069926
V  0.246381  2.990500 -0.373869 -0.157011
W -0.584769  0.463351 -2.462991  1.291161
Y -0.340432  0.012877 -0.235633 -0.833351

In [17]:
# Now we know how to access col, add col, drop col and drop row

# Now accessing particular row
df.loc['U']

A   -0.023375
B    0.343985
C   -0.346258
D   -0.069926
Name: U, dtype: float64

In [18]:
# accessing multiple rows
df.loc[ ['U', 'Y'] ]

          A         B         C         D
U -0.023375  0.343985 -0.346258 -0.069926
Y -0.340432  0.012877 -0.235633 -0.833351

In [19]:
# Now instead of accessing row by index name, we can access by integer index

# iloc means integer based location
# it will return 0th and 2nd row
df.iloc[ [0, 2] ]

          A         B         C         D
U -0.023375  0.343985 -0.346258 -0.069926
W -0.584769  0.463351 -2.462991  1.291161

In [20]:
# Now accessing subset of data
# selecting A, B column and U, W row

# This will select first U, W row and this will return dataframe and then finally selecting A and B column
df.loc[ ['U', 'W'] ][ ['A', 'B'] ]

          A         B
U -0.023375  0.343985
W -0.584769  0.463351

In [21]:
# Another way of doing this

# this is numpy like indexing  first rows, columns
df.loc[ ['U', 'W'], ['A', 'B'] ]

          A         B
U -0.023375  0.343985
W -0.584769  0.463351

In [22]:
# Now performing some conditions on dataframe

# this will return boolean of dataframe
df > 0

       A     B      C      D
U  False  True  False  False
V   True  True  False  False
W  False  True  False   True
Y  False  True  False  False

In [23]:
# now getting values with this condition

# it will return values where df > 0, ( broadcasting is done here )
df[ df > 0 ]

          A         B   C         D
U       NaN  0.343985 NaN       NaN
V  0.246381  2.990500 NaN       NaN
W       NaN  0.463351 NaN  1.291161
Y       NaN  0.012877 NaN       NaN

In [24]:
# applying condition on specific column, and most of the times we will be doing that :D

df['A'] > 0

U    False
V     True
W    False
Y    False
Name: A, dtype: bool

In [25]:
# selecting all the rows where value of A > 0
df[ df['A'] > 0 ]

          A       B         C         D
V  0.246381  2.9905 -0.373869 -0.157011

In [26]:
# if you want particular column

df[ df['A'] > 0 ][ ['A', 'C'] ]

          A         C
V  0.246381 -0.373869

In [30]:
# applying mulitple conditions on dataframe
# and it is pandas requires that you keep all the conditions in the brackets
# df[ df['A'] < 0 & df['C'] < 0 ] -> this will return error as there are no brackets

# selecting all cols where A < 0 and C < 0; 
df[ (df['A'] < 0) & (df['C'] < 0) ]

          A         B         C         D
U -0.023375  0.343985 -0.346258 -0.069926
W -0.584769  0.463351 -2.462991  1.291161
Y -0.340432  0.012877 -0.235633 -0.833351

In [33]:
# selecting all cols where A < 0 or C < 0; 

df[ (df['A'] < 0) | (df['C'] < 0) ]

          A         B         C         D
U -0.023375  0.343985 -0.346258 -0.069926
V  0.246381  2.990500 -0.373869 -0.157011
W -0.584769  0.463351 -2.462991  1.291161
Y -0.340432  0.012877 -0.235633 -0.833351